tutorials/sizeChanged/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale    1;

vertices
(
    (0 0 0)
    (0.6 0 0)
    (0.6 0.21 0)
    (0 0.21 0)
    (0 0 0.6)
    (0.6 0 0.6)
    (0.6 0.21 0.6)
    (0 0.21 0.6)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 20 60) simpleGrading (1 1 1)
);

defaultPatch
{
    name    walls;
    type    wall;
}

boundary
();


// ************************************************************************* //
